#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//大端（存储）模式：数据的低位保存在内存的高地址中，高位保存在内存的低地址中
//小端（存储）模式：数据的低位保存在内存的低地址中，高位保存在内存的高地址中

//写一段代码告诉我们当前机器的字节序是什么

//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//
//int main()
//{
//	//返回1，小端
//	//返回0，大端
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//整数在内存中的存储
// 
//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a = %d b = %d c = %d", a, b, c);
//	return 0;
//}

//int main()
//{
//
//	  char a = -128;
//	  //10000000000000000000010000000
//    //11111111111111111111101111111
//    //11111111111111111111110000000 - 补码
//    //10000000
//    //11111111111111111111110000000 - 补码
//
//	  printf("%u\n", a);
//
//	  //%u - 打印十进制的无符号数字
//	  //%d - 打印十进制的有符号数字
//
//	  return 0;
//}

//#include<windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//
//	return 0;
//}

//典中典   -128-1 = 127   127+1 = -128
//#include<string.h>
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}

//浮点数在内存中的存储 
// 单精度 0 00000000 00000000000000000000000
// 双精度 0 00000000000 000.......0000000000
//       S   E           M
// (-1)^S  *  M  *  2^E
// S:正数取0，负数取1，取什么放什么
// M:大于等于1，小于2，放内存时只放小数点后面
// E:怎么移怎么取，放内存时加127

int main()
{
	int n = 9;
	float* pFloat = (float*)&n;
	printf("n的值为: %d\n", n);// 9
	printf("*pFloat的值为: %f\n", *pFloat);// 0.000000
	//00000000000000000000000000010001
	//0 00000000 00000000000000000010001

	*pFloat = 9.0;
	//1001.0
	//1.0010*2^3
	//3+127=130 10000010
	//0 10000010 00100000000000000000000
	//1000001000100000000000000000000
	printf("n的值为: %d\n", n);// 1091567616
	printf("*pFloat的值为: %f\n", *pFloat);// 9.0

	return 0;
}